Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Acquiring state lock. This may take a few moments...
aws_security_group.instance: Refreshing state... [id=sg-07c06c3a6c5549a70]
aws_security_group.alb: Refreshing state... [id=sg-0821d052f1592ea78]
aws_launch_configuration.example: Refreshing state... [id=terraform-20210112145944089400000001]
aws_lb_target_group.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cef34a56f80861fb]
aws_lb.example: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:loadbalancer/app/terraform-asg-example/bb6846babd9af390]
aws_autoscaling_group.example: Refreshing state... [id=tf-asg-20210112145945271000000002]
aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener/app/terraform-asg-example/bb6846babd9af390/2f05ed5605b36dd4]
aws_lb_listener_rule.asg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:869946923544:listener-rule/app/terraform-asg-example/bb6846babd9af390/2f05ed5605b36dd4/02f55e2c0985fa8c]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.example will be updated in-place
~ resource "aws_autoscaling_group" "example" {
        id                        = "tf-asg-20210112145945271000000002"
      ~ launch_configuration      = "terraform-20210112145944089400000001" -> (known after apply)
        name                      = "tf-asg-20210112145945271000000002"
      ~ target_group_arns         = [
          - "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cef34a56f80861fb",
        ] -> (known after apply)
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_launch_configuration.example must be replaced
+/- resource "aws_launch_configuration" "example" {
      ~ arn                              = "arn:aws:autoscaling:us-east-2:869946923544:launchConfiguration:eb771920-3615-4be5-819f-39f197f60dd6:launchConfigurationName/terraform-20210112145944089400000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "terraform-20210112145944089400000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "terraform-20210112145944089400000001" -> (known after apply)
      ~ user_data                        = "b28728ee47dd3e96016b1d23e4e6baf7343bf128" -> "21544352205d2199b0c81d4c41c4c13cde93abb1" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (5 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb_listener_rule.asg will be updated in-place
~ resource "aws_lb_listener_rule" "asg" {
        id           = "arn:aws:elasticloadbalancing:us-east-2:869946923544:listener-rule/app/terraform-asg-example/bb6846babd9af390/2f05ed5605b36dd4/02f55e2c0985fa8c"
        # (3 unchanged attributes hidden)

      ~ action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cef34a56f80861fb" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.asg must be replaced
-/+ resource "aws_lb_target_group" "asg" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cef34a56f80861fb" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/terraform-asg-example/cef34a56f80861fb" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:869946923544:targetgroup/terraform-asg-example/cef34a56f80861fb" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "terraform-asg-example"
      ~ port                               = 9090 -> 8080 # forces replacement
      - tags                               = {} -> null
        # (7 unchanged attributes hidden)


      ~ stickiness {
          ~ cookie_duration = 86400 -> (known after apply)
          ~ enabled         = false -> (known after apply)
          ~ type            = "lb_cookie" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_security_group.instance will be updated in-place
~ resource "aws_security_group" "instance" {
        id                     = "sg-07c06c3a6c5549a70"
      ~ ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 9090
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 9090
            },
        ]
        name                   = "terraform-example-instance"
        tags                   = {}
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://d0b0ad16db30.ngrok.io/lock?id=jonico%252Fatlantis-example%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
